In [1]:
import pandas as pd

In [2]:
staff_df = pd.DataFrame([ {'Name' : 'Kelly' , 'Role' : 'Diretor de RH'},
                          {'Name' : 'Sally' , 'Role' : 'Course liasion'},
                          {'Name' : 'James' , 'Role' : 'Grader'}
                        ])
staff_df = staff_df.set_index('Name')

print(staff_df.head())

                 Role
Name
Kelly   Diretor de RH
Sally  Course liasion
James          Grader

In [3]:
student_df = pd.DataFrame([ {'Name' : 'James' , 'Scholl' : 'Business'},
                            {'Name' : 'Mike' , 'Scholl' : 'Law'},
                            {'Name' : 'Sally' , 'Scholl' : 'Engineering'}
                          ])
student_df = student_df.set_index('Name')

print(student_df.head())

            Scholl
Name
James     Business
Mike           Law
Sally  Engineering

## Possui Todos

In [4]:
pd.merge(staff_df,student_df, how='outer' , left_index=True, right_index=True)

                 Role       Scholl
Name
James          Grader     Business
Kelly   Diretor de RH          NaN
Mike              NaN          Law
Sally  Course liasion  Engineering

## Interseção

In [5]:
pd.merge(staff_df,student_df, how='inner' , left_index=True, right_index=True)

                 Role       Scholl
Name
Sally  Course liasion  Engineering
James          Grader     Business

## Quem tem Role

In [6]:
pd.merge(staff_df,student_df, how='left' , left_index=True, right_index=True)

                 Role       Scholl
Name
Kelly   Diretor de RH          NaN
Sally  Course liasion  Engineering
James          Grader     Business

## Quem tem Scholl

In [10]:
pd.merge(staff_df,student_df, how='right' , left_index=True, right_index=True)

                 Role       Scholl
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course liasion  Engineering

## Usando coluna no join

In [11]:
staff_df2 = staff_df.reset_index()
student_df2 = student_df.reset_index()

In [12]:
pd.merge(staff_df2,student_df2, how="right" , on="Name")

    Name            Role       Scholl
0  James          Grader     Business
1   Mike             NaN          Law
2  Sally  Course liasion  Engineering

Join MultiColuna

In [15]:
staff_df = pd.DataFrame([{'First Name' : 'Kelly' , 'Last Name' : 'Desjardins' , 'Role' : 'Diretor de RH'},
                         {'First Name' : 'Sally' , 'Last Name' : 'Brooks' , 'Role' : 'Course liason'},
                         {'First Name' : 'James' , 'Last Name' : 'Wilde', 'Role' : 'Grader'}])
staff_df

  First Name   Last Name           Role
0      Kelly  Desjardins  Diretor de RH
1      Sally      Brooks  Course liason
2      James       Wilde         Grader

In [16]:
student_df = pd.DataFrame([{'First Name' : 'James' , 'Last Name' : 'Hammond' , 'Scholl' : 'Business'},
                           {'First Name' : 'Mike' , 'Last Name' : 'Smith' , 'Scholl' : 'Law'},
                           {'First Name' : 'Sally' , 'Last Name' : 'Brooks' , 'Scholl' : 'Engineering'}])
student_df

  First Name Last Name       Scholl
0      James   Hammond     Business
1       Mike     Smith          Law
2      Sally    Brooks  Engineering

In [18]:
pd.merge(staff_df, student_df, how="inner" , on=['First Name' , 'Last Name'])

  First Name Last Name           Role       Scholl
0      Sally    Brooks  Course liason  Engineering